*** Git
#+name: git-workflow-up
#+begin_src bash :results replace raw
source ~/repos/basecamp/lib/basecamp_functions.sh
cd ~/repos/emseq
output=$(git_wkflow_up 2>&1)
if [ $? -ne 0 ]; then
    echo "Error running git_wkflow_up"
    echo "$output"
    exit 1
fi

echo -e "$(date)\n$output"

#+end_src

#+RESULTS: git-workflow-up
Tue Jun 10 12:09:57 PM CDT 2025
[master dac7ee5] .
 2 files changed, 4 insertions(+), 4 deletions(-)
To github.com:jeszyman/emseq.git
   1095335..dac7ee5  master -> master
Mon Jun  9 09:24:27 AM CDT 2025
[master 6ded313] .
 2 files changed, 2 insertions(+), 2 deletions(-)
To github.com:jeszyman/emseq.git
   4862c0c..6ded313  master -> master
